// data-pai.js - Pangkalan Data Pendidikan Agama Islam LexiQuest V2
const paiQuestions = {
    "aqidah": [
        {
            id: "AQ01",
            question: "روکون إيمان مڠندوڠي براڤ ڤرکارا؟",
            options: ["ليم ڤرکارا", "امڤت ڤرکارا", "انم ڤرکارا", "توجوه ڤرکارا"],
            answer: 2
        },
        {
            id: "AQ02",
            question: "اڤاکه روکون إيمان يڠ ڤرتام؟",
            options: ["إيمان کڤد کتاب", "إيمان کڤد الله", "إيمان کڤد رسول", "إيمان کڤد هاري قيامة"],
            answer: 1
        },
        {
            id: "AQ03",
            question: "ارتي إسلام دري سڬي بهاس اياله ڤاتوه دان ___ .",
            options: ["ملاون", "طاعة", "لاري", "ماراه"],
            answer: 1
        },
        {
            id: "AQ04",
            question: "براڤاکه بيلڠن صيفت واجب باڬي الله SWT؟",
            options: ["٢٥ صيفت", "١٠ صيفت", "٤ صيفت", "٢٠ صيفت"],
            answer: 3
        },
        {
            id: "AQ05",
            question: "صيفت واجب 'وجود' باڬي الله برارتي ___ .",
            options: ["اد", "تيدق اد", "سديا", "بينسا"],
            answer: 0
        },
        {
            id: "AQ06",
            question: "لاون باڬي صيفت وجود اياله 'عدم' يڠ برارتي ___ .",
            options: ["ککل", "ماتي", "تياد", "لمه"],
            answer: 2
        },
        {
            id: "AQ07",
            question: "صيفت 'قدم' bagi الله برمقصود ___ .",
            options: ["سديا اد", "بهارو", "بربيذا", "بهاڬيا"],
            answer: 0
        },
        {
            id: "AQ08",
            question: "براڤاکه صيفت مستحيل يڠ wajib دکتاهوءي باڬي الله؟",
            options: ["٢٠ صيفت", "٥٠ صيفت", "٣ صيفت", "١٣ صيفت"],
            answer: 0
        },
        {
            id: "AQ09",
            question: "براڤاکه صيفت هارس باڬي الله SWT؟",
            options: ["دوءا صيفت", "ساتو صيفت", "تيدق اد", "باڽق"],
            answer: 1
        },
        {
            id: "AQ10",
            question: "نام الله 'الخالق' برارتي مها ___ .",
            options: ["مڠتاهوءي", "مليهت", "منچيڤتا", "مندڠر"],
            answer: 2
        },
        {
            id: "AQ11",
            question: "ملائکة دچيڤتاکن اوليه الله درڤد ___ .",
            options: ["تانه", "اڤي", "أڠين", "نور اوتارا چهاي"],
            answer: 3
        },
        {
            id: "AQ12",
            question: "براڤاکه بيلڠن ملائکة يڠ wajib دکتاهوءي؟",
            options: ["٢٥ ملائکة", "١٠ ملائکة", "٥ ملائکة", "٥٠ ملائکة"],
            answer: 1
        },
        {
            id: "AQ13",
            question: "ملائکة يڠ برتوڬس ممباوا وحي اياله ___ .",
            options: ["ميکائيل", "إسرافيل", "جبريل", "عزرائيل"],
            answer: 2
        },
        {
            id: "AQ14",
            question: "ملائکة ميکائيل برتوڬس لنتوق ___ .",
            options: ["منورونکن حوجن دان رزقي", "منچابوت ڽاوا", "منجاڬ شرڬ", "تيوڤ سڠکاکالا"],
            answer: 0
        },
        {
            id: "AQ15",
            question: "ملائکة يڠ برتوڬس منچاتت عملن باءيق اياله ___ .",
            options: ["عتيد", "رقيب", "منکر", "نکير"],
            answer: 1
        },
        {
            id: "AQ16",
            question: "ملائکة يڠ برتوڬس منچاتت عملن بوروق اياله ___ .",
            options: ["رقيب", "رضوان", "مالك", "عتيد"],
            answer: 3
        },
        {
            id: "AQ17",
            question: "ملائکة إسرافيل برتوڬس اونتوق ___ .",
            options: ["منچابوت ڽاوا", "منجاڬ نراک", "مسبوتسو تيوڤ سڠکاکالا", "سوءال دالم قبور"],
            answer: 2
        },
        {
            id: "AQ18",
            question: "ملائکة عزرائيل برتوڬس اونتوق ___ .",
            options: ["منچابوت ڽاوا", "ممباوا وحي", "منجاڬ شرڬ", "منورونکن هوجن"],
            answer: 0
        },
        {
            id: "AQ19",
            question: "ملائکة يڠ برتوڬس منجاڬ شرڬ اياله ___ .",
            options: ["مالك", "رضوان", "منکر", "نکير"],
            answer: 1
        },
        {
            id: "AQ20",
            question: "ملائکة يڠ برتوڬس منجاڬ نراک اياله ___ .",
            options: ["رضوان", "جبريل", "مالك", "ميکائيل"],
            answer: 2
        },
        {
            id: "AQ21",
            question: "براڤاکه بيلڠن کتاب يڠ واجب دکتاهوءي؟",
            options: ["امڤت کتاب", "ليم کتاب", "تڬ کتاب", "سڤولوه کتاب"],
            answer: 0
        },
        {
            id: "AQ22",
            question: "کتاب توراة ديتورونکن کڤد نبي ___ .",
            options: ["نبي عيسى", "نبي داود", "نبي موسى", "نبي محمد"],
            answer: 2
        },
        {
            id: "AQ23",
            question: "کتاب زبور ديتورونکن کڤد نبي ___ .",
            options: ["نبي داود", "نبي ابراهيم", "نبي نوح", "نبي موسى"],
            answer: 0
        },
        {
            id: "AQ24",
            question: "کتاب إنجيل ديتورونکن کڤd نبي ___ .",
            options: ["نبي محمد", "نبي عيسى", "نبي يوسف", "نبي سليمان"],
            answer: 1
        },
        {
            id: "AQ25",
            question: "کتاب القرءان ديتورونکن کڤد نبي ___ .",
            options: ["نبي ادم", "نبي موسى", "نبي داود", "نبي محمد"],
            answer: 3
        },
        {
            id: "AQ26",
            question: "القرءان ديتورونکن دالم بهاس ___ .",
            options: ["ملايو", "عرب", "إڠڬريس", "ڤرسيا"],
            answer: 1
        },
        {
            id: "AQ27",
            question: "براڤاکه بيلڠن رسول يڠ واجب دکتاهوءي؟",
            options: ["١٠ رسول", "٢٥ رسول", "٥٠ رسول", "٣١٣ رسول"],
            answer: 1
        },
        {
            id: "AQ28",
            question: "سياڤاکه رسول يڠ ڤرتام؟",
            options: ["نبي نوح", "نبي ابراهيم", "نبي ادم", "نبي ادريس"],
            answer: 2
        },
        {
            id: "AQ29",
            question: "سياڤاکه رسول يڠ تراخير؟",
            options: ["نبي عيسى", "نبي موسى", "نبي محمد صلي الله عليه وسلم", "نبي اسماعيل"],
            answer: 2
        },
        {
            id: "AQ30",
            question: "براڤاکه صيفت واجب باڬي رسول؟",
            options: ["امڤت صيفت", "ليم صيفت", "تڬ صيفت", "صيفت٢٠"],
            answer: 0
        },
        {
            id: "AQ31",
            question: "صيفت واجب 'صديق' باڬي رسول برارتي ___ .",
            options: ["جوجور", "بيجقسان", "بنر", "مڽمڤايکن"],
            answer: 2
        },
        {
            id: "AQ32",
            question: "صيفت واجب 'أمانة' باڬي رسول برارتي ___ .",
            options: ["دوستا", "دڤرچاياءي / جوجور", "بودوه", "مڽمبوڽيکن"],
            answer: 1
        },
        {
            id: "AQ33",
            question: "صيفت واجب 'تبليغ' باڬي رسول برارتي ___ .",
            options: ["مڽمڤايکن", "بيجقسان", "بنر", "امانة"],
            answer: 0
        },
        {
            id: "AQ34",
            question: "صيفت واجب 'فطانة' باڬي رسول برارتي ___ .",
            options: ["لمه", "دوستا", "بيجقسان", "جوجور"],
            answer: 2
        },
        {
            id: "AQ35",
            question: "لاون باڬي صيفت صديق اياله 'کذب' يڠ برارتي ___ .",
            options: ["خيانة", "دوستا / بوهوڠ", "بودوه", "مڽمبوڽيکن"],
            answer: 1
        },
        {
            id: "AQ36",
            question: "لاون باڬي صيفت أمانة اياله 'خيانة' يڠ برارتي ___ .",
            options: ["تيدق جوجور", "بنر", "بيجق", "طاعة"],
            answer: 0
        },
        {
            id: "AQ37",
            question: "لاون باڬي صيفت تبليغ اياله 'کتمان' يڠ برارتي ___ .",
            options: ["مڽمبوڽيکن", "مڽمڤايکن", "بوهوڠ", "بودوه"],
            answer: 0
        },
        {
            id: "AQ38",
            question: "لاون باڬي صيفت فطانة اياله 'بلادة' يڠ برارتي ___ .",
            options: ["بيجقسان", "بنر", "بودوه", "امانة"],
            answer: 2
        },
        {
            id: "AQ39",
            question: "براڤاکه بيلڠن رسول يڠ منداڤت ڬلرن اولوا العزم؟",
            options: ["تڬ رسول", "امڤت رسول", "ليم رسول", "توجوه رسول"],
            answer: 2
        },
        {
            id: "AQ40",
            question: "اڤاکه نام لاءين باڬي هاري قيامة؟",
            options: ["يوم الدين", "يوم الجمعة", "يوم الاثنين", "يوم العيد"],
            answer: 0
        },
        {
            id: "AQ41",
            question: "إيمان کڤد قضاء دان قدر اياله روکون إيمان يڠ ک- ___ .",
            options: ["امڤت", "ليم", "انم", "تڬ"],
            answer: 2
        },
        {
            id: "AQ42",
            question: "مقصود 'قضاء' اياله کتتڤن الله سبحانه وتعالى سجق ___ .",
            options: ["ازلي", "سماليم", "هاري اين", "تامت دونيا"],
            answer: 0
        },
        {
            id: "AQ43",
            question: "مقصود 'قدر' اياله ___ کتتڤن يڠ تله دتتڤکن اوليه الله .",
            options: ["ڤلقساناءن", "ڤمبطالن", "ڤراوبهن", "ڤراراڠن"],
            answer: 0
        },
        {
            id: "AQ44",
            question: "صيفت واجب 'بقاء' باڬي الله برارتي ___ .",
            options: ["بينسا", "بهارو", "ککل", "اد"],
            answer: 2
        },
        {
            id: "AQ45",
            question: "صيفت 'مخالفته للحوادث' برارتي الله ___ دڠن يڠ بهارو.",
            options: ["سام", "بربيذا", "همڤير", "سنتياس"],
            answer: 1
        },
        {
            id: "AQ46",
            question: "صيفت واجب 'وحدانية' باڬي الله برارتي الله سبحانه وتعالى اءو اياله ___ .",
            options: ["اسا / ساتو", "باڽق", "دوءا", "لمه"],
            answer: 0
        },
        {
            id: "AQ47",
            question: "کسن برإيمان کڤd الله اياله سنتياس ___ ڤرينتهڽا.",
            options: ["منيڠڬلکن", "ملاون", "ماتوهي / طاعة", "ملوڤاکن"],
            answer: 2
        },
        {
            id: "AQ48",
            question: "عملن مڽوتوکن الله سبحانه وتعالى دڠن يڠ لاءين دکنلي كبهاس ___ .",
            options: ["شيريك", "نفاق", "فاسق", "کفور"],
            answer: 0
        },
        {
            id: "AQ49",
            question: "دوسا بسر يڠ تيدق اكن دأمڤونکن تانڤا توبة نصوحا اياله دوسا ___ .",
            options: ["منچوري", "شيريك", "بوهوڠ", "ماري ماراه"],
            answer: 1
        },
        {
            id: "AQ50",
            question: "أسماء الحسنى برارتي نام٢ الله سبحانه وتعالى يڠ ___ .",
            options: ["بوروق", "اينده دان باءيق", "بياسا", "سديريجت"],
            answer: 1
        }
    ],
    "ibadah": [
        {
            id: "IB01",
            question: "روکون إسلام مڠندوڠي براڤ ڤرکارا؟",
            options: ["امڤت ڤرکارا", "ليم ڤرکارا", "انم ڤرکارا", "توجوه ڤرکارا"],
            answer: 1
        },
        {
            id: "IB02",
            question: "اڤاکه روکون إسلام يڠ ڤرتام؟",
            options: ["مڠوچڤ دوا کلمة شهادة", "منوperiodکن صلاة", "برڤواسا", "منونايرکن زکوة"],
            answer: 0
        },
        {
            id: "IB03",
            question: "براڤاکه بيلڠن صلاة فرض دالم سهاري سمالم؟",
            options: ["تڬ وقتو", "امڤت وقتو", "ليم وقتو", "انم وقتو"],
            answer: 2
        },
        {
            id: "IB04",
            question: "براڤاکه بيلڠن رکعة باڬي صلاة صبح؟",
            options: ["ساتو رکعة", "دوا رکعة", "تڬ رکعة", "امڤت رکعة"],
            answer: 1
        },
        {
            id: "IB05",
            question: "براڤاکه بيلڠن رکعة باڬي صلاة مغرب؟",
            options: ["دوا رکعة", "تڬ رکعة", "امڤت رکعة", "ليم رکعة"],
            answer: 1
        },
        {
            id: "IB06",
            question: "صلاة ظهر، عصر دان عشاء مڠندوڠي ___ رکعة.",
            options: ["دوا رکعة", "تڬ رکعة", "امڤت رکعة", "ليم رکعة"],
            answer: 2
        },
        {
            id: "IB07",
            question: "توجوان اوتام کيت بردستور دان بروضوء اياله اونتوق ___ .",
            options: ["مڠهيلڠکن هادست", "امبرسيهکن باجو", "مڽڬرکن بادن", "منونجوق-نونجوق"],
            answer: 0
        },
        {
            id: "IB08",
            question: "اڤاکه ممرلواکن أءير مطلق اونتوق بروضوء؟",
            options: ["أءير سوڠاي", "أءير تابه", "أءير کلاڤ", "أءير کوڤي"],
            answer: 0
        },
        {
            id: "IB09",
            question: "أءير يڠ برچمڤور دڠن بندا نجس دکنلي سباڬاي ___ .",
            options: ["أءير مطلق", "أءير مستعمل", "أءير متنجس", "أءير مشمس"],
            answer: 2
        },
        {
            id: "IB10",
            question: "براڤاکه روکون وضوء يڠ واجب دلاکوکن؟",
            options: ["امڤت روکون", "ليم روکون", "انم روکون", "توجوه روکون"],
            answer: 2
        },
        {
            id: "IB11",
            question: "ممباسوه تڠن هيڠڬ کو چوڤوڠ سيکو ترماسوق دالم ___ وضوء.",
            options: ["روکون", "سنة", "مکروه", "حرام"],
            answer: 0
        },
        {
            id: "IB12",
            question: "برکومور-کومور سماس بروضوء حکومڽا ___ .",
            options: ["واجب", "سنة", "حرام", "مکروه"],
            answer: 1
        },
        {
            id: "IB13",
            question: "اڤاکه ڤرکارا يڠ ممبطالکن وضوء؟",
            options: ["برچاکڤ", "مکان", "کلوار سسواتو دري دوبور/قبول", "تيدور سچارا دودوق"],
            answer: 2
        },
        {
            id: "IB14",
            question: "الأن چست کلوار ڤولق يڠ مڽرتاءي صلاة دسبوت ___ .",
            options: ["أذان", "إقامة", "ذکر", "تکبير"],
            answer: 0
        },
        {
            id: "IB15",
            question: "حکوم ملاءوڠکن أذان باڬي صلاة فرض اياله ___ .",
            options: ["سنة مؤکد", "فرض عين", "فرض کفاية", "هارس"],
            answer: 2
        },
        {
            id: "IB16",
            question: "سياڤاکه نام مؤذن (ڤلاوڠ أذان) ڤرتام دالم إسلام؟",
            options: ["بلال بن رباح", "ابو بکر", "عمر بن الخطاب", "علي بن ابي طالب"],
            answer: 0
        },
        {
            id: "IB17",
            question: "اڤاکه علامة ماسوقڽ وقتو صلاة صبح؟",
            options: ["تربيت فجر صادق", "تڠڬلم matahari", "ماتهاري داتس کڤالا", "تربيت ماتهاري"],
            answer: 0
        },
        {
            id: "IB18",
            question: "روکون صلاة ترهادڤ بهاڬين تيندقن باچاءن دسبوت روکون ___ .",
            options: ["قولي (باچاءن)", "فعلي (ڤربواتن)", "قلبي (هاتي)", "صوري"],
            answer: 0
        },
        {
            id: "IB19",
            question: "روکون صلاة ترهادڤ ڤربواتن بادن دسبوت روکون ___ .",
            options: ["قولي", "فعلي (ڤربواتن)", "قلبي", "معنوي"],
            answer: 1
        },
        {
            id: "IB20",
            question: "نيت دالم صلاة ترماسوق دالم روکون ___ .",
            options: ["فعلي", "قولي", "قلبي (هاتي)", "سنة"],
            answer: 2
        },
        {
            id: "IB21",
            question: "براڤاکه بيلڠن روکون صلاة کسمووهنڽا؟",
            options: ["١٠ روکون", "١٣ روکون", "١٥ روکون", "٢٠ روکون"],
            answer: 1
        },
        {
            id: "IB22",
            question: "ممباچ سورة الفاتحة دالم صلاة حکومڽا ___ .",
            options: ["واجب / روکون", "سنة", "هارس", "مکروه"],
            answer: 0
        },
        {
            id: "IB23",
            question: "تونينيڠ (توقف سبنتر) سماس رکوع دان سجود دسبوت ___ .",
            options: ["طمأنينة", "جلسه", "اعتدا", "قنوت"],
            answer: 0
        },
        {
            id: "IB24",
            question: "باچاءن قنوت دلاکوکن سماس صلاة ___ .",
            options: ["ظهر", "عصر", "صبح", "عشاء"],
            answer: 2
        },
        {
            id: "IB25",
            question: "برڤرکتان يڠ سڠاج دالم صلاة بوليه ___ .",
            options: ["ممبطالکن صلاة", "منمبهکن ڤاهالا", "منمبهکن رکعة", "سنة"],
            answer: 0
        },
        {
            id: "IB26",
            question: "اراه کعبة يڠ منجادي هادڤن اومت إسلام سماس صلاة دسبوت ___ .",
            options: ["محراب", "قبلة", "مناره", "مسجد"],
            answer: 1
        },
        {
            id: "IB27",
            question: "صلاة برجميعه ممڤوڽاءي کليبيهن ___ درجات بربنديڠ صلاة سأورڠ ديري.",
            options: ["١٠ درجات", "١٧ درجات", "٢٧ درجات", "٥٠ درجات"],
            answer: 2
        },
        {
            id: "IB28",
            question: "اورڠ يڠ مڠمور ايمين دالم صلاة برجميعه دسبوت ___ .",
            options: ["امام", "مأموم", "بلال", "قاري"],
            answer: 0
        },
        {
            id: "IB29",
            question: "اورڠ يڠ مڠيکوت امام دالم صلاة برجميعه دسبوت ___ .",
            options: ["مکي", "مأموم", "والي", "مؤذن"],
            answer: 1
        },
        {
            id: "IB30",
            question: "مأموم يڠ تلمبت دان تيدق دانت مڠيکوت باچاءن الفاتحة امام دسبوت ___ .",
            options: ["مأموم موافق", "مأموم مسبوق", "مأموم مسافر", "مأموم مريض"],
            answer: 1
        },
        {
            id: "IB31",
            question: "صلاة دوا رکعة يڠ دلاکوکن ڤد هاري راي عيد الفطري حکومڽا ___ .",
            options: ["واجب", "سنة مؤکد", "هارس", "فرض کفاية"],
            answer: 1
        },
        {
            id: "IB32",
            question: "براڤاکه بيلڠن خطبة باڬي صلاة هاري راي دان صلاة جعة؟",
            options: ["ساتو خطبة", "دوا خطبة", "تڬ خطبة", "تياد خطبة"],
            answer: 1
        },
        {
            id: "IB33",
            question: "صلاة فرض جمعة دلاکوکن ڤد هاري جمعة باڬي کاوم ___ .",
            options: ["وانيتا", "للاکي", "کانق٢", "مسافر وانيتا"],
            answer: 1
        },
        {
            id: "IB34",
            question: "منجاموقکن دوا صلاة فرض دالم ساتو وقتو دسبوت صلاة ___ .",
            options: ["قصر", "جمع", "وتر", "تراويح"],
            answer: 1
        },
        {
            id: "IB35",
            question: "مڠورڠکن رکعة صلاة فرض درڤد امڤت منجادي دوا رکعة دسبوت ___ .",
            options: ["جمع", "قصر", "سجود سهوي", "تيمم"],
            answer: 1
        },
        {
            id: "IB36",
            question: "مڠڬنتيکن وضوء دڠن دبو تانه يڠ سوچي دسبوت ___ .",
            options: ["استنجاء", "تيمم", "غسل", "مسح"],
            answer: 1
        },
        {
            id: "IB37",
            question: "حکوم منونايرکن عبادة ڤواسا دبلن رمضان اياله ___ .",
            options: ["سنة", "فرض عين", "فرض کفاية", "هارس"],
            answer: 1
        },
        {
            id: "IB38",
            question: "براتور مکان سبلوم ماسوق وقتو صبح دسبوت ___ .",
            options: ["بربکال", "برصحور", "افتطار", "تراويح"],
            answer: 1
        },
        {
            id: "IB39",
            question: "مکان دان مينوم دڠن سڠاج بوليه ___ ڤواسا.",
            options: ["ممبطالکن", "مڠصحکن", "منمبه ڤاهالا", "ميوتوکن"],
            answer: 0
        },
        {
            id: "IB40",
            question: "صلاة سنة يڠ هاڽ دلاکوکن دالم بولن رمضان اياله صلاة ___ .",
            options: ["وتر", "تراويح", "تهجد", "ضحى"],
            answer: 1
        },
        {
            id: "IB41",
            question: "مڠلوارکن هرتا ترتنتو کڤد اسناف يڠ لایق دسبوت ___ .",
            options: ["صدقة", "زکوة", "وقاف", "هدية"],
            answer: 1
        },
        {
            id: "IB42",
            question: "زکوة يڠ wajib دکلوارکن سبلوم صلاة عيد الفطري اياله زکوة ___ .",
            options: ["هرتا", "Fitrah (فطرة)", "امس", "ڤرنياڬاءن"],
            answer: 1
        },
        {
            id: "IB43",
            question: "براڤاکه بيلڠن ڬولوڠن (اسناف) يڠ لایق منريما زکوة؟",
            options: ["ليم ڬولوڠن", "انم ڬولوڠن", "توجوه ڬولوڠن", "لڤن ڬولوڠن"],
            answer: 3
        },
        {
            id: "IB44",
            question: "مقصود عبادة حج اياله مڠونجوڠي ___ اونتوق ملاکوکن عبادة ترتنتو.",
            options: ["بيت المقدس", "بيت الله (مکه)", "مسجد النبي", "قبة الصخرة"],
            answer: 1
        },
        {
            id: "IB45",
            question: "مڠليليڠي کعبة سوباڽق توجوه کالي دسبوت ___ .",
            options: ["سعي", "طواف", "وقوف", "تحلل"],
            answer: 1
        },
        {
            id: "IB46",
            question: "برجالن اولڠ-اليق انتارا بوکيت صفا دان مروة دسبوت ___ .",
            options: ["طواف", "سعي", "وقوف", "مبيت"],
            answer: 1
        },
        {
            id: "IB47",
            question: "براد دڤادڠ عرفة ڤد ٩ ذوالحجة دسبوت ___ .",
            options: ["وقوف", "تحلل", "إحرام", "طواف"],
            answer: 0
        },
        {
            id: "IB48",
            question: "برچوکر اتاو مڠونتيڠ رامبوت سبلوم سليسائي حج دسبوت ___ .",
            options: ["تحلل", "سعي", "وقوف", "رمي"],
            answer: 0
        },
        {
            id: "IB49",
            question: "مڽومبليه بيناتڠ ترناري سباڬاي تندا شکور کڤد الله دسمڤيڠ هاري راي قربان دسبوت ___ .",
            options: ["عقيقة", "قربان", "صدقة", "وليمة"],
            answer: 1
        },
        {
            id: "IB50",
            question: "مڽومبليه بيناتڠ ترناري سسبنا جنيس سيمڤنا کلاهيرن باي دسبوت ___ .",
            options: ["قربان", "عقيقة", "نذر", "هدية"],
            answer: 1
        }
    ],
    "sirah": [
        {
            id: "SR01",
            question: "دکوت مناکاه نبي محمد صلي الله عليه وسلم دلاهرکن؟",
            options: ["مدينة", "مکه", "طائف", "شام"],
            answer: 1
        },
        {
            id: "SR02",
            question: "اڤاکه ڬلرن يڠ دبريري اوليه مڠتاهوءي قريش کڤد نبي محمد کران کجوجورن بڬيندا؟",
            options: ["الصديق", "الأمين", "الفاروق", "ذوالنورين"],
            answer: 1
        },
        {
            id: "SR03",
            question: "بيلاراکه تاريخ کلاهيرن نبي Muhammad SAW؟",
            options: ["١٢ ربيع الأول", "١٠ محرم", "١٧ رمضان", "١ Syawal"],
            answer: 0
        },
        {
            id: "SR04",
            question: "نبي محمد صلي الله عليه وسلم دلاهرکن ڤد تاهون ___ .",
            options: ["تاهون ليمو", "تاهون ڬاجه", "تاهون أڠين", "تاهون کوده"],
            answer: 1
        },
        {
            id: "SR05",
            question: "سياڤاکه نام باڤ نبي محمد صلي الله عليه وسلم؟",
            options: ["ابو طالب", "عبد المطلب", "عبد الله", "ابو لهب"],
            answer: 2
        },
        {
            id: "SR06",
            question: "سياڤاکه نام ايبو نبي محمد صلي الله عليه وسلم؟",
            options: ["أمنة بنت وهب", "خديجة بنت خويلد", "فاطمة بنت اسد", "حليمة السعدية"],
            answer: 0
        },
        {
            id: "SR07",
            question: "سياڤاکه نام داتوق نبي محمد يڠ مڠمبل عليه تڠڬوڠجاواب منجاڬ بڬيندا سلڤس ايبوڽا وافة؟",
            options: ["ابو طالب", "عبد المطلب", "حمزة", "عباس"],
            answer: 1
        },
        {
            id: "SR08",
            question: "سياڤاکه ايبو سوسوان نبي محمد يڠ ڤاليڠ لاما منجاڬ بڬيندا دڤدومن دوقون؟",
            options: ["ثويبة الأسلمية", "حليمة السعدية", "ام اءيمن", "فاطمة"],
            answer: 1
        },
        {
            id: "SR09",
            question: "براڤاکه عمور نبي محمد سماس ايبو بڬيندا، أمنة، وافة دالأبواء؟",
            options: ["٤ تاهون", "٦ تاهون", "٨ تاهون", "١٠ تاهون"],
            answer: 1
        },
        {
            id: "SR10",
            question: "براڤاکه عمور نبي محمد سماس داتوق بڬيندا، عبد المطلب، وافة؟",
            options: ["٦ تاهون", "٨ تاهون", "١٢ تاهون", "٢٥ تاهون"],
            answer: 1
        },
        {
            id: "SR11",
            question: "سياڤاکه نام باڤ ساودارا يڠ منجاڬ نبي محمد سلڤس وافة داتوق بڬيندا؟",
            options: ["ابو لهب", "ابو طالب", "حمزة", "العباس"],
            answer: 1
        },
        {
            id: "SR12",
            question: "اڤاکه ڤکرجاءن نبي محمد سماس موده دان تيڠڬل برسام باڤ ساودارا بڬيندا؟",
            options: ["مڠمبالا کامبيڠ دان برنياڬا", "منوجو", "ممليهارا اءيکن", "تاني"],
            answer: 0
        },
        {
            id: "SR13",
            question: "سياڤاکه نام ايسستري ڤرتام نبي محمد صلي الله عليه وسلم؟",
            options: ["عائشة بنت ابي بکر", "خديجة بنت خويلد", "حفصة بنت عمر", "زينب"],
            answer: 1
        },
        {
            id: "SR14",
            question: "براڤاکه عمور نبي محمد سماس برکهوين دڠن سيتي خديجة؟",
            options: ["٢٠ تاهون", "٢٥ تاهون", "٣٠ تاهون", "٤٠ تاهون"],
            answer: 1
        },
        {
            id: "SR15",
            question: "براڤاکه عمور سيتي خديجة سماس برکهوين دڠن نبي محمد؟",
            options: ["٢٥ تاهون", "٣٠ تاهون", "٣٥ تاهون", "٤٠ تاهون"],
            answer: 3
        },
        {
            id: "SR16",
            question: "دکوت مناکاه نبي محمد منريما وحي يڠ ڤرتام؟",
            options: ["ڬوا ثور", "ڬوا حراء", "مسجد الحرام", "بوکيت صفا"],
            answer: 1
        },
        {
            id: "SR17",
            question: "براڤاکه عمور نبي محمد صلي الله عليه وسلم سماس دلقبتکن منجادي رسول؟",
            options: ["٢٥ تاهون", "٣٠ تاهون", "٤٠ تاهون", "٦٣ تاهون"],
            answer: 2
        },
        {
            id: "SR18",
            question: "اڤاکه سورة ڤرتام يڠ ديتورونکن اوليه الله کڤد نبي محمد؟",
            options: ["سورة الفاتحة", "سورة العلق", "سورة الإخلاص", "سورة الکوثر"],
            answer: 1
        },
        {
            id: "SR19",
            question: "سياڤاکه وانيتا ڤرتام يڠ مملوق إسلام؟",
            options: ["عائشة", "سيتي خديجة", "فاطمة", "ام سلمه"],
            answer: 1
        },
        {
            id: "SR20",
            question: "سياڤاکه للاکي ديواسا ڤرتام يڠ مملوق إسلام؟",
            options: ["عمر بن الخطاب", "ابو بکر الصديق", "عثمان بن عفان", "علي بن ابي طالب"],
            answer: 1
        },
        {
            id: "SR21",
            question: "سياڤاکه کانق٢ ڤرتام يڠ مملوق إسلام؟",
            options: ["زيد بن حارثة", "علي بن ابي طالب", "عبد الله بن عباس", "حسن بن علي"],
            answer: 1
        },
        {
            id: "SR22",
            question: "سياڤاکe همبا ڤرتام يڠ مملوق إسلام؟",
            options: ["بلال بن رباح", "زيد بن حارثة", "ياسر", "عمار"],
            answer: 1
        },
        {
            id: "SR23",
            question: "براڤ تاهونکه نبي محمد منجالنکن دعوه سچارا رهسيا؟",
            options: ["٢ تاهون", "٣ تاهون", "٥ تاهون", "١٠ تاهون"],
            answer: 1
        },
        {
            id: "SR24",
            question: "دکوت مناکاه مرکز ڤروندوڠن دعوه سچارا رهسيا دجالنکن؟",
            options: ["رومه ارقم بن ابي الارقم", "رومه ابو بکر", "ڬوا حراء", "دار الندوة"],
            answer: 0
        },
        {
            id: "SR25",
            question: "اڤاکه معجزة تربسر نبي محمد صلي الله عليه وسلم؟",
            options: ["بله ماتهاري", "القرءان الکريم", "کلوار اءير دري چله جاري", "مڠهيدوڤکن اورڠ ماتي"],
            answer: 1
        },
        {
            id: "SR26",
            question: "ڤريستيوا مالام نبي محمد دباوا دري مکة کبيت المقدس دان کلاڠيت دسبوت ___ .",
            options: ["هجرة", "إسراء دان معراج", "فتح مکه", "بعثة"],
            answer: 1
        },
        {
            id: "SR27",
            question: "اڤاکه ڤرينته واجب يڠ دتريما نبي سماس ڤريستيوا إسراء دان معراج؟",
            options: ["ڤواسا رمضان", "صلاة فرض ليم وقتو", "منونايرکن حج", "زکوة"],
            answer: 1
        },
        {
            id: "SR28",
            question: "اومت إسلام برهجرة دري مکة کمدينة اونتوق ___ .",
            options: ["برنياڬا", "منيلقکن ديري دري تيندس فوريس دان مپيبرکن إسلام", "ملنچوڠ", "ملاون امام"],
            answer: 1
        },
        {
            id: "SR29",
            question: "سياڤاکه صحابت يڠ منيڠڬلکن نبي محمد سماس برهجرة کمدينة؟",
            options: ["عمر بن الخطاب", "ابو بکر الصديق", "عثمان بن عفان", "علي بن ابي طالب"],
            answer: 1
        },
        {
            id: "SR30",
            question: "دکوت مناکاه نبي دان ابو بکر برسمبوڽي دري بوروان کافر قريش سماس هجرة؟",
            options: ["ڬوا حراء", "ڬوا ثور", "بوکيت احد", "مدين"],
            answer: 1
        },
        {
            id: "SR31",
            question: "اڤاکه نام اصل کوتا مدينة سبلوم کچاتتن هجرة نبي؟",
            options: ["طائف", "يثرب", "خيبر", "جدة"],
            answer: 1
        },
        {
            id: "SR32",
            question: "اڤاکه مسجد ڤرتام يڠ دبينا اوليه نبي محمد سماس دالم ڤرجالنن هجرة؟",
            options: ["مسجد الحرام", "مسجد قباء", "مسجد النبي", "مسجد الأقصى"],
            answer: 1
        },
        {
            id: "SR33",
            question: "ڬولوڠن ڤندودوق اصل مدينة يڠ ممبنتو اومت إسلام يڠ برهجرة دسبوت ڬولوڠن ___ .",
            options: ["مهاجرين", "انصار", "قريش", "يهودي"],
            answer: 1
        },
        {
            id: "SR34",
            question: "ڬولوڠن اومت إسلام يڠ برهجرة دري مکة کمدينة دسبوت ڬولوڠن ___ .",
            options: ["انصار", "مهاجرين", "خوارج", "منافق"],
            answer: 1
        },
        {
            id: "SR35",
            question: "اڤاکه ڤڤراڠن ڤرتام دالم سجاره إسلام؟",
            options: ["ڤڤراڠن احد", "ڤڤراڠن بدر", "ڤڤراڠن خندق", "ڤڤراڠن حنين"],
            answer: 1
        },
        {
            id: "SR36",
            question: "براڤاکه بيلڠن خيبر / تنترا إسلام دالم ڤڤراڠن بدر؟",
            options: ["١,٠٠٠ اورڠ", "٣١٣ اورڠ", "٧٠٠ اورڠ", "٣,٠٠٠ اورڠ"],
            answer: 1
        },
        {
            id: "SR37",
            question: "ڤڤراڠن يڠ مان اومت إسلام مڠکامي ککالهن کران ايڠکر ارهن نبي سباڬاي ڤمانه؟",
            options: ["ڤڤراڠن بدر", "ڤڤراڠن احد", "ڤڤراڠن خندق", "ڤڤراڠن تبوك"],
            answer: 1
        },
        {
            id: "SR38",
            question: "ڤڤراڠن خندق جوڬ دکنلي سباڬاي ڤڤراڠن ___ کران ڤرڬابوڠن موسوه.",
            options: ["احزاب", "مؤتة", "يرموك", "حنين"],
            answer: 0
        },
        {
            id: "SR39",
            question: "سياڤاکه صحابت يڠ منچادڠکنستراتيڬي مڠڬالي ڤاريت (خندق) دالم ڤڤراڠن خندق؟",
            options: ["بلال بن رباح", "سلمان الفارس", "خالد بن الوليد", "ابو هريرة"],
            answer: 1
        },
        {
            id: "SR40",
            question: "اڤاکه نام ڤرجنجين داماي انتارا اومت إسلام دان کافر قريش مکة؟",
            options: ["ڤرجنجين عقبة", "ڤرجنجين حديبية", "ڤياڬم مدينة", "صالح حديبية"],
            answer: 1
        },
        {
            id: "SR41",
            question: "ڤريستيوا ڤمبوکاءن سمولا کوتا مکة اوليه اومت إسلام دسبوت ___ .",
            options: ["هجرة", "فتح مکه", "غزوة", "حجة الوداع"],
            answer: 1
        },
        {
            id: "SR42",
            question: "ڤد تاهون کبراڤاکه هجرة برلاکوڽا ڤريستيوا فتح مکه؟",
            options: ["٢ هجرة", "٥ هجرة", "٨ هجرة", "١٠ هجرة"],
            answer: 2
        },
        {
            id: "SR43",
            question: "اڤاکه تيندقن ڤرتام نبي سلڤس دافت ممبوک کوتا مکة؟",
            options: ["مڠهنچورکن برهالا دکليليڠ کعبة", "ملاکوکن ڤڤراڠن", "ممليهارا هرتا", "موجودکن چوکاي"],
            answer: 0
        },
        {
            id: "SR44",
            question: "اڤاکه نام ڤروندوڠن اوتام يڠ دتوليس اونتوق مپاتوکن ڤندودوق مدينة؟",
            options: ["ڤرجنجين حديبية", "ڤياڬم مدينة", "خطبة الوداع", "لوح محفوظ"],
            answer: 1
        },
        {
            id: "SR45",
            question: "سياڤاکه نام انق ڤرمڤوان نبي يڠ برکهوين دڠن سيئدينا علي بن ابي طالب؟",
            options: ["زينب", "فاطمة الزهراء", "رقمة", "ام کلثوم"],
            answer: 1
        },
        {
            id: "SR46",
            question: "حج تراخير يڠ دلاکوکن اوليه نبي محمد سبلوم وافة دسبوت ___ .",
            options: ["حج اکبر", "حجة الوداع", "حج مبرور", "عمرة"],
            answer: 1
        },
        {
            id: "SR47",
            question: "براڤاکه عمور نبي محمد صلي الله عليه وسلم سماس بڬيندا وافة؟",
            options: ["٢٥ تاهون", "٤٠ تاهون", "٦٠ تاهون", "٦٣ تاهون"],
            answer: 3
        },
        {
            id: "SR48",
            question: "دکوت مناکاه نبي محمد صلي الله عليه وسلم وافة دان دميقمکن؟",
            options: ["مکه", "مدينة", "شام", "بيت المقدس"],
            answer: 1
        },
        {
            id: "SR49",
            question: "نبي محمد وافة ددالم رومه ايسستري بڬيندا يڠ برنام ___ .",
            options: ["خديجة", "عائشة بنت ابي بکر", "سودة", "حفصة"],
            answer: 1
        },
        {
            id: "SR50",
            question: "مقام نبي محمد صلي الله عليه وسلم کيني ترلتق ددالم ___ دمدينة.",
            options: ["مسجد قباء", "مسجد النبي (النبوي)", "مسجد الأقصى", "مسجد قبتين"],
            answer: 1
        }
    ],
    "akhlak": [
        {
            id: "AK01",
            question: "اڤاکه مقصود اخلاق دري سڬي بهاس؟",
            options: ["ڤاکاين يڠ چنتيق", "بودي ڤکرتي / تيڠکه لاکو", "هرتا يڠ باڽق", "علمو ڤڠتاهوان"],
            answer: 1
        },
        {
            id: "AK02",
            question: "اخلاق يڠ باءيق دان دتونتوت دالم إسلام دسبوت اخلاق ___ .",
            options: ["مذمومة", "محمودة", "سيئة", "کاذبة"],
            answer: 1
        },
        {
            id: "AK03",
            question: "اخلاق يڠ بوروق دان دبنچي اوليه الله دسبوت اخلاق ___ .",
            options: ["محمودة", "مذمومة", "حسنة", "کريمة"],
            answer: 1
        },
        {
            id: "AK04",
            question: "انتارا بريکوت، يڠ ماناکه چونتوه اخلاق محمودة (ترڤوجي)؟",
            options: ["سومبوڠ", "حسد دڠکي", "جوجور دان امانة", "کدکوت"],
            answer: 2
        },
        {
            id: "AK05",
            question: "انتارا بريکوت، يڠ ماناکه چونتوه اخلاق مذمومة (ترکجي)؟",
            options: ["برصبر", "تکاثر / ريال", "رياء دان منونجوق-نونجوق", "تولوڠ-منولوڠ"],
            answer: 2
        },
        {
            id: "AK06",
            question: "اڤاکه يڠ ڤرلو کيت باچ سبلوم ممولاکن مکان اتاو مينوم؟",
            options: ["الحمد لله", "بسم الله الرحمن الرحيم", "استغفر الله", "الله اکبر"],
            answer: 1
        },
        {
            id: "AK07",
            question: "کيت دسونتکن مکان دان مينوم مڠڬوناکن تڠن ___ .",
            options: ["کيري", "کانن", "کدوا-دواڽ", "تڠن سبلها"],
            answer: 1
        },
        {
            id: "AK08",
            question: "سلڤس سليسائي مکان، کيت دأنجورکن مڠوچڤ ___ سباڬاي تندا شکور.",
            options: ["الحمد لله", "سبحان الله", "بسم الله", "ما شاء الله"],
            answer: 0
        },
        {
            id: "AK09",
            question: "انتارا ادب سبلوم تيدور اياله ___ .",
            options: ["مکان دڠن کڽڠ", "بروضوء دان ممباچ دعاء", "منونتون تيۏي", "برماءين تليفون"],
            answer: 1
        },
        {
            id: "AK10",
            question: "اڤاکه اوچڤن يڠ سسواي اڤابيلا کيت باڠون دري تيدور؟",
            options: ["الحمد لله الذي أحيانا", "بسم الله مجراها", "إنا لله وإنا إليه راجعون", "لا حول ولا قوة إلا بالله"],
            answer: 0
        },
        {
            id: "AK11",
            question: "سباڬاي سأورڠ انق، کيت wajib ___ کڤد ايبو باڤ.",
            options: ["طاعة دان بربقتي", "ملاون چاکڤ", "منڠيڠڬلکن", "مميايکن"],
            answer: 0
        },
        {
            id: "AK12",
            question: "مقصود 'بر الوالدين' اياله ___ کڤد ايبو باڤ.",
            options: ["بربوات جاهت", "بربوات باءيق (بربقتي)", "مڠهينا", "برکاسر"],
            answer: 1
        },
        {
            id: "AK13",
            question: "مندرهاک کڤد ايبو باڤ مروڤاکن ساله ساتو دوسا ___ دالم إسلام.",
            options: ["کچيل", "بياسا", "بسر", "هارس"],
            answer: 2
        },
        {
            id: "AK14",
            question: "اڤاکه يڠ ڤرلو کيت لکوکن اڤابيلا برجلان ملسي اتاو برتمو ڬورو؟",
            options: ["لاري دان سمبوڽي", "ممبري سلام دان مانسيپ", "منجليت", "بربوال دڠن کاون"],
            answer: 1
        },
        {
            id: "AK15",
            question: "مڠحرمتي ڬورو سڠت ڤنتيڠ سوڤايا کيت منداڤت ___ دالم منونتوت علمو.",
            options: ["کبرکتن", "ککايأن", "کڬاڬلن", "کسوساهن"],
            answer: 0
        },
        {
            id: "AK16",
            question: "برچاکڤ دڠن سوارا يڠ تيڠڬي اتاو منجرتيه دالمبادن ڬورو اياله ڤربواتن ___ .",
            options: ["ترڤوجي", "تيدق برادب", "باڬوس", "واجب"],
            answer: 1
        },
        {
            id: "AK17",
            question: "سماس ماسوق کتاندس، کيت دسونتکن ملڠکه ماسوق دڠن کاکي ___ .",
            options: ["کانن", "کيري", "کدوا-دواڽ", "تيدق کيسه"],
            answer: 1
        },
        {
            id: "AK18",
            question: "سماس کلوار دري تاندس، کيت دسونتکن ملڠکه کلوار دڠن کاکي ___ .",
            options: ["کيري", "کدوا-دواڽ", "کانن", "ملومڤت"],
            answer: 2
        },
        {
            id: "AK19",
            question: "سبلوم ماسوق تاندس کيت ڤرلو ممباچ دعاء موهون ڤرليندوڠن درڤد ڬڠڬوان ___ .",
            options: ["ماءنسي", "ملائکة", "شيطان", "حيوات"],
            answer: 2
        },
        {
            id: "AK20",
            question: "اڤاکه يڠ دسونتکن باڬي سأورڠ اونتوق سبوت اڤابيلا دي برسين؟",
            options: ["الله اکبر", "الحمد لله", "سبحان الله", "استغفر الله"],
            answer: 1
        },
        {
            id: "AK21",
            question: "اڤاکه اوچڤن کيت اڤابيلا مندڠر راکن کيت برسين دان ممباچ 'الحمد لله'؟",
            options: ["يرحمك الله", "ما شاء الله", "تبارك الله", "جزاك الله"],
            answer: 0
        },
        {
            id: "AK22",
            question: "اورڠ إسلام واجب منوتوڤ ___ ترأوتاما اڤابيلا براد دلور رومه.",
            options: ["موک", "مات", "عورة", "تليڠا"],
            answer: 2
        },
        {
            id: "AK23",
            question: "بواتاسن عورة باڬي للاکي اياله دري ڤوست هيڠڬ ___ .",
            options: ["بتاهيس", "لوتوت", "دادا", "کڤالا"],
            answer: 1
        },
        {
            id: "AK24",
            question: "عورة وانيتا اياله سلوروه بادن کچوالي موک دان ___ .",
            options: ["رامبوت", "تاڤق کاکي", "تاڤق تڠن", "تليڠا"],
            answer: 2
        },
        {
            id: "AK25",
            question: "ڤراسان ماراه يڠ تيدق دکاول بياساڽ برڤونچا دري هاشوتن ___ .",
            options: ["شيطان", "کاون", "نفسو", "حيوات"],
            answer: 0
        },
        {
            id: "AK26",
            question: "انتارا چارا دأنجورکن نبي اونتوق ممريداکن ماراه اياله دڠن مڠمبيل ___ .",
            options: ["مکانن", "وضوء", "تيدور", "هيبورن"],
            answer: 1
        },
        {
            id: "AK27",
            question: "انتارا ادب برڬاءول دڠن راکن اياله ___ دالم ڤرکارا يڠ باءيق.",
            options: ["ساليڠ برڬادوه", "ساليڠ ممبنتو", "ساليڠ مڠهينا", "ساليڠ بربوهوڠ"],
            answer: 1
        },
        {
            id: "AK28",
            question: "ممڠڬيل راکن دڠن ڬلرن يڠ بوروق دان مڽاکيتکن هاتي حکومڽا ___ .",
            options: ["حرام", "هارس", "سنة", "مکروه"],
            answer: 0
        },
        {
            id: "AK29",
            question: "سسياڤا يڠ برصبر اڤابيلا دتيمڤا اوجين دان مصيبة اکن منداڤت ___ درڤد الله.",
            options: ["دوسا", "ڤاهالا يڠ بسر", "ککايأن", "کسيحتن"],
            answer: 1
        },
        {
            id: "AK30",
            question: "کيت دأرهکن تولوڠ-منولوڠ دالم ڤرکارا کباجيقن دان تقوى، تتاڤي دلارڠ بکتو دالم ڤرکارا ___ .",
            options: ["کباءيقن", "دوسا دان ڤرموسوهن", "منونتوت علمو", "برنياڬا"],
            answer: 1
        },
        {
            id: "AK31",
            question: "اڤاکه ادب يڠ ڤرلو دلاکوکن سبلوم ماسوق کرومه اورڠ لاءين؟",
            options: ["منرجاه ماسوق", "مڠتوق ڤينتو دان ممبري سلام", "مڠينتيڤ دري تيڠکڤ", "ممبواڠ کاست"],
            answer: 1
        },
        {
            id: "AK32",
            question: "توجوان اوتام منزيارهي اورڠ يڠ ساكيت اياله اونتوق ممبري سماڠت دان ___ .",
            options: ["مماکن مکاننڽ", "مندعاکن کسمبوهنڽا", "ممبوات بيسيڠ", "منونجوقکن کسيحتن کيت"],
            answer: 1
        },
        {
            id: "AK33",
            question: "نبي برسبدا، صيفت حسد دڠکي اکن مماکن ڤاهالا سڤرتي اڤي مماکن ___ .",
            options: ["اءير", "کايو کريڠ", "باتو", "بسي"],
            answer: 1
        },
        {
            id: "AK34",
            question: "ڤربواتن ممينتا معاف اڤابيلا ڤرنه ملاکوکن کسيلاڤن اياله چيري اورڠ يڠ ___ .",
            options: ["لمه", "ڤناکوت", "مليا دان برتڠڬوڠجاواب", "بودوه"],
            answer: 2
        },
        {
            id: "AK35",
            question: "مڠوچڤکن 'تريما کاسيه' کڤد ماءنسي مروڤاکن تندا کيت ___ کڤد نعمت الله.",
            options: ["لالی", "برشکور", "سومبوڠ", "ماره"],
            answer: 1
        },
        {
            id: "AK36",
            question: "إسلام مڠاجر بهاوا منجاڬ کبرسيهن اياله سبهاڬين درڤد ___ .",
            options: ["ککايأن", "إيمان", "کصيحتن", "کچنتيقن"],
            answer: 1
        },
        {
            id: "AK37",
            question: "سبلوم ممباچ القرءان، کيت دسونتکن اونتوق مڠمبيل وضوء دان مڠهادڤ ___ .",
            options: ["بلکڠ", "أوتارا", "قبلة", "سلاتن"],
            answer: 2
        },
        {
            id: "AK38",
            question: "اڤابيلا ماسوق کمسجد، کيت دأنجورکن برنيت ___ .",
            options: ["تيدور", "إعتکاف", "برماءين", "بربوال"],
            answer: 1
        },
        {
            id: "AK39",
            question: "بربوال کوسوڠ اتاو ممبوات بيسيڠ سهيڠڬ مڠڬڠڬو اورڠ صلاة دمسجد حکومڽا ___ .",
            options: ["مکروه / حرام", "سنة", "هارس", "واجب"],
            answer: 0
        },
        {
            id: "AK40",
            question: "سماس برجالن، خوصوڽ دتمڤت عوام، کيت هندقله سنتياس منوندوقکن ___ .",
            options: ["کڤالا", "ڤندڠن (مات)", "تڠن", "کاکي"],
            answer: 1
        },
        {
            id: "AK41",
            question: "سبلوم ممولاکن ڤرجالنن (مسافر)، کيت دسونتکن ممباچ ___ .",
            options: ["بوکو", "دعاء مناءيقي کندرأن", "ڤويسي", "بريتا"],
            answer: 1
        },
        {
            id: "AK42",
            question: "ممبواڠ سمڤه دمراتا-رات تمڤت دان مڠوتورکن عالم مروڤاکن ڤربواتن يڠ ___ .",
            options: ["ترڤوجي", "تيدق برتڠڬوڠجاواب (مذمومة)", "باءيق", "دڬالقکن"],
            answer: 1
        },
        {
            id: "AK43",
            question: "منجاڬ هرتا عوام سڤرتي تاندس دان تمڤت تومڤڠن اياله تڠڬوڠجاواب ___ .",
            options: ["کراجاءن سهاج", "سموا مشارکت", "ڤکرجا ڤمبرسيهن", "کتوا کامڤوڠ"],
            answer: 1
        },
        {
            id: "AK44",
            question: "نبي محمد منجللکن بهاوا برچاکڤ بوهوڠ مروڤاکن ساله ساتو تندا اورڠ ___ .",
            options: ["مؤمن", "منافق", "صالح", "متّقين"],
            answer: 1
        },
        {
            id: "AK45",
            question: "سلاين بوهوڠ، ميموڠکيري جنجي جوڬ مروڤاکن چيري-چيري اورڠ ___ .",
            options: ["منافق", "مؤمن", "صالح", "علماء"],
            answer: 0
        },
        {
            id: "AK46",
            question: "مڠخياناتي امانة (تيدق جوجور دالم توڬس) اکن منداڤت ___ الله.",
            options: ["کريضاءن", "کمورکاءن", "کبهاڬيأن", "کأمتن"],
            answer: 1
        },
        {
            id: "AK47",
            question: "اورڠ يڠ بخيل (کدکوت) اونتوق برصدقه اکن دبنچي اوليه ماءنسي دان ___ .",
            options: ["الله سبحانه وتعالى", "حيوان", "شيطان", "ملائکة"],
            answer: 0
        },
        {
            id: "AK48",
            question: "عملن برصدقه تيدق مڠورڠکن هرتا، ماله بوليه ممادمکن ___ الله.",
            options: ["رحمة", "کمورکاءن / کماهارهن", "کاسيه سايڠ", "رضا"],
            answer: 1
        },
        {
            id: "AK49",
            question: "نبي محمد صلي الله عليه وسلم دأوتوسکن کڤد ماءنسي اونتوق مڽمڤورناکن ___ يڠ مليا.",
            options: ["اخلاق", "ڤاکاين", "رومه", "ڤکرجاءن"],
            answer: 0
        },
        {
            id: "AK50",
            question: "سباءيق-باءيق اخلاق باڬي سأورڠ مسلم اياله دڠن منچونتوهي اخلاق ___ .",
            options: ["نبي محمد صلي الله عليه وسلم", "ارتيس", "ڤميمڤين دونيا", "کاون٢"],
            answer: 0
        }
    ]
};